uusYritys/app/views/posts/index.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
<p>post, jonka ID on 5</p>
<p> <%= Post.find(6).name %></p>

SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "posts"
---
<%= "lasketaan post määrät" %>
<p> <%= Post.count %></p>