uusYritys/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "content" = 'asdsafsafsfasdsafsafsfasdsafsafsfasdsafsafsdsdsdasdsafsafsf', "updated_at" = '2013-05-23 20:06:36.183953' WHERE "posts"."id" = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])